app/views/docs/_form.html.erb

SELECT `categories`.* FROM `categories`
---
		<%= f.label :category_id %><br />
		<%= f.select :category_id, Category.all.collect {|c| [ c.name.capitalize, c.id ] }.sort%>

SELECT `api_versions`.* FROM `api_versions`
---
		<%= f.label :api_version_id %><span class="hint">Choose all possible versions</span><br />
		<% for api_version in ApiVersion.all %>