app/controllers/docs_controller.rb

SELECT `docs`.* FROM `docs` WHERE (`docs`.category_id = 1)
---
  def index
    @docs = Doc.all

SELECT `docs`.* FROM `docs` WHERE (`docs`.category_id = 1)
---
  def show
    @doc = Doc.find(params[:id])

SELECT `docs`.* FROM `docs` WHERE (`docs`.category_id = 1)
---
  def edit
    @doc = Doc.find(params[:id])

INSERT INTO `docs` (`title_short`, `title_long`, `description`, `http_method`, `requires_authentication`, `query_format`, `sample_query`, `parameters`, `response_format`, `response_output_format`, `created_at`, `updated_at`, `category_id`, `success_codes`, `error_codes`) VALUES ('HOw to be awesome', '<p>Initial content</p>', '<p>Initial content</p>', '', '', '<p>Initial content</p>', '<p>Initial content</p>', '<p>Initial content</p>', '', '<p>Initial content</p>', '2012-06-01 07:24:55', '2012-06-01 07:24:55', 3, '<p>Initial content</p>', '<p>Initial content</p>')
---
  def create

    @doc = Doc.new(params[:doc])

    respond_to do |format|
      if @doc.save

SELECT `docs`.* FROM `docs` WHERE `docs`.`id` = 1 LIMIT 1
UPDATE `docs` SET `category_id` = 2, `parameters` = '<p></p><table border=\"1\" style=\"width: 100%;\"><tbody><tr><td>Lorem ipsum</td><td>Lorem ipsum</td><td>Lorem ipsum</td></tr><tr><td>Lorem ipsum</td><td>Lorem ipsum</td><td>Lorem ipsum</td></tr><tr><td>Lorem ipsum</td><td>Lorem ipsum</td><td>Lorem ipsum</td></tr></tbody></table><p></p>', `success_codes` = '<p></p><p>{</p><p>&nbsp; \"success\": false,</p><p>&nbsp; \"payload\": {</p><p>&nbsp; &nbsp;</p><p>&nbsp; },</p><p>&nbsp; \"error\": {</p><p>&nbsp; &nbsp; \"code\": 123,</p><p>&nbsp; &nbsp; \"message\": \"An error occurred!\"</p><p>&nbsp; }</p><p>}</p><p></p>', `error_codes` = '<p></p><p>{</p><p>&nbsp; \"success\": false,</p><p>&nbsp; \"payload\": {</p><p>&nbsp; &nbsp;</p><p>&nbsp; },</p><p>&nbsp; \"error\": {</p><p>&nbsp; &nbsp; \"code\": 123,</p><p>&nbsp; &nbsp; \"message\": \"An error occurred!\"</p><p>&nbsp; }</p><p>}</p><p></p>', `updated_at` = '2013-05-16 11:49:01' WHERE `docs`.`id` = 1
---
  def update
    @doc = Doc.find(params[:id])

    respond_to do |format|
      if @doc.update_attributes(params[:doc])